grevaillot/svd_tools/headers/STM32F21x/cryp.h
#pragma once 

/* --- CRYP: Cryptographic processor -------------------------------- */

/** @defgroup cryp_registers Cryptographic processor Register
@{*/

/** CRYP_CR control register **/
#define CRYP_CR			MMIO32(CRYP_BASE + 0x00)
/** CRYP_SR status register **/
#define CRYP_SR			MMIO32(CRYP_BASE + 0x04)
/** CRYP_DIN data input register **/
#define CRYP_DIN			MMIO32(CRYP_BASE + 0x08)
/** CRYP_DOUT data output register **/
#define CRYP_DOUT			MMIO32(CRYP_BASE + 0x0c)
/** CRYP_DMACR DMA control register **/
#define CRYP_DMACR			MMIO32(CRYP_BASE + 0x10)
/** CRYP_IMSCR interrupt mask set/clear register **/
#define CRYP_IMSCR			MMIO32(CRYP_BASE + 0x14)
/** CRYP_RISR raw interrupt status register **/
#define CRYP_RISR			MMIO32(CRYP_BASE + 0x18)
/** CRYP_MISR masked interrupt status register **/
#define CRYP_MISR			MMIO32(CRYP_BASE + 0x1c)
/** CRYP_K0LR key registers **/
#define CRYP_K0LR			MMIO32(CRYP_BASE + 0x20)
/** CRYP_K0RR key registers **/
#define CRYP_K0RR			MMIO32(CRYP_BASE + 0x24)
/** CRYP_K1LR key registers **/
#define CRYP_K1LR			MMIO32(CRYP_BASE + 0x28)
/** CRYP_K1RR key registers **/
#define CRYP_K1RR			MMIO32(CRYP_BASE + 0x2c)
/** CRYP_K2LR key registers **/
#define CRYP_K2LR			MMIO32(CRYP_BASE + 0x30)
/** CRYP_K2RR key registers **/
#define CRYP_K2RR			MMIO32(CRYP_BASE + 0x34)
/** CRYP_K3LR key registers **/
#define CRYP_K3LR			MMIO32(CRYP_BASE + 0x38)
/** CRYP_K3RR key registers **/
#define CRYP_K3RR			MMIO32(CRYP_BASE + 0x3c)
/** CRYP_IV0LR initialization vector registers **/
#define CRYP_IV0LR			MMIO32(CRYP_BASE + 0x40)
/** CRYP_IV0RR initialization vector registers **/
#define CRYP_IV0RR			MMIO32(CRYP_BASE + 0x44)
/** CRYP_IV1LR initialization vector registers **/
#define CRYP_IV1LR			MMIO32(CRYP_BASE + 0x48)
/** CRYP_IV1RR initialization vector registers **/
#define CRYP_IV1RR			MMIO32(CRYP_BASE + 0x4c)

/**@}*/


/** @defgroup cryp_cr CR control register
@{*/

/** CRYP_CR_CRYPEN Cryptographic processor enable **/
#define CRYP_CR_CRYPEN		(1 << 15)
/** CRYP_CR_FFLUSH FIFO flush **/
#define CRYP_CR_FFLUSH		(1 << 14)

#define CRYP_CR_KEYSIZE_SHIFT		8
#define CRYP_CR_KEYSIZE_MASK		0x03
/** @defgroup cryp_cr_keysize KEYSIZE Key size selection (AES mode only)
@{*/
/**@}*/


#define CRYP_CR_DATATYPE_SHIFT		6
#define CRYP_CR_DATATYPE_MASK		0x03
/** @defgroup cryp_cr_datatype DATATYPE Data type selection
@{*/
/**@}*/


#define CRYP_CR_ALGOMODE_SHIFT		3
#define CRYP_CR_ALGOMODE_MASK		0x07
/** @defgroup cryp_cr_algomode ALGOMODE Algorithm mode
@{*/
/**@}*/

/** CRYP_CR_ALGODIR Algorithm direction **/
#define CRYP_CR_ALGODIR		(1 << 2)

/**@}*/

/** @defgroup cryp_sr SR status register
@{*/

/** CRYP_SR_BUSY Busy bit **/
#define CRYP_SR_BUSY		(1 << 4)
/** CRYP_SR_OFFU Output FIFO full **/
#define CRYP_SR_OFFU		(1 << 3)
/** CRYP_SR_OFNE Output FIFO not empty **/
#define CRYP_SR_OFNE		(1 << 2)
/** CRYP_SR_IFNF Input FIFO not full **/
#define CRYP_SR_IFNF		(1 << 1)
/** CRYP_SR_IFEM Input FIFO empty **/
#define CRYP_SR_IFEM		(1 << 0)

/**@}*/

/** @defgroup cryp_din DIN data input register
@{*/


#define CRYP_DIN_DATAIN_SHIFT		0
#define CRYP_DIN_DATAIN_MASK		0xffffffff
/** @defgroup cryp_din_datain DATAIN Data input
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_dout DOUT data output register
@{*/


#define CRYP_DOUT_DATAOUT_SHIFT		0
#define CRYP_DOUT_DATAOUT_MASK		0xffffffff
/** @defgroup cryp_dout_dataout DATAOUT Data output
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_dmacr DMACR DMA control register
@{*/

/** CRYP_DMACR_DOEN DMA output enable **/
#define CRYP_DMACR_DOEN		(1 << 1)
/** CRYP_DMACR_DIEN DMA input enable **/
#define CRYP_DMACR_DIEN		(1 << 0)

/**@}*/

/** @defgroup cryp_imscr IMSCR interrupt mask set/clear register
@{*/

/** CRYP_IMSCR_OUTIM Output FIFO service interrupt mask **/
#define CRYP_IMSCR_OUTIM		(1 << 1)
/** CRYP_IMSCR_INIM Input FIFO service interrupt mask **/
#define CRYP_IMSCR_INIM		(1 << 0)

/**@}*/

/** @defgroup cryp_risr RISR raw interrupt status register
@{*/

/** CRYP_RISR_OUTRIS Output FIFO service raw interrupt status **/
#define CRYP_RISR_OUTRIS		(1 << 1)
/** CRYP_RISR_INRIS Input FIFO service raw interrupt status **/
#define CRYP_RISR_INRIS		(1 << 0)

/**@}*/

/** @defgroup cryp_misr MISR masked interrupt status register
@{*/

/** CRYP_MISR_OUTMIS Output FIFO service masked interrupt status **/
#define CRYP_MISR_OUTMIS		(1 << 1)
/** CRYP_MISR_INMIS Input FIFO service masked interrupt status **/
#define CRYP_MISR_INMIS		(1 << 0)

/**@}*/

/** @defgroup cryp_k0lr K0LR key registers
@{*/

/** CRYP_K0LR_b255 b255 **/
#define CRYP_K0LR_b255		(1 << 31)
/** CRYP_K0LR_b254 b254 **/
#define CRYP_K0LR_b254		(1 << 30)
/** CRYP_K0LR_b253 b253 **/
#define CRYP_K0LR_b253		(1 << 29)
/** CRYP_K0LR_b252 b252 **/
#define CRYP_K0LR_b252		(1 << 28)
/** CRYP_K0LR_b251 b251 **/
#define CRYP_K0LR_b251		(1 << 27)
/** CRYP_K0LR_b250 b250 **/
#define CRYP_K0LR_b250		(1 << 26)
/** CRYP_K0LR_b249 b249 **/
#define CRYP_K0LR_b249		(1 << 25)
/** CRYP_K0LR_b248 b248 **/
#define CRYP_K0LR_b248		(1 << 24)
/** CRYP_K0LR_b247 b247 **/
#define CRYP_K0LR_b247		(1 << 23)
/** CRYP_K0LR_b246 b246 **/
#define CRYP_K0LR_b246		(1 << 22)
/** CRYP_K0LR_b245 b245 **/
#define CRYP_K0LR_b245		(1 << 21)
/** CRYP_K0LR_b244 b244 **/
#define CRYP_K0LR_b244		(1 << 20)
/** CRYP_K0LR_b243 b243 **/
#define CRYP_K0LR_b243		(1 << 19)
/** CRYP_K0LR_b242 b242 **/
#define CRYP_K0LR_b242		(1 << 18)
/** CRYP_K0LR_b241 b241 **/
#define CRYP_K0LR_b241		(1 << 17)
/** CRYP_K0LR_b240 b240 **/
#define CRYP_K0LR_b240		(1 << 16)
/** CRYP_K0LR_b239 b239 **/
#define CRYP_K0LR_b239		(1 << 15)
/** CRYP_K0LR_b238 b238 **/
#define CRYP_K0LR_b238		(1 << 14)
/** CRYP_K0LR_b237 b237 **/
#define CRYP_K0LR_b237		(1 << 13)
/** CRYP_K0LR_b236 b236 **/
#define CRYP_K0LR_b236		(1 << 12)
/** CRYP_K0LR_b235 b235 **/
#define CRYP_K0LR_b235		(1 << 11)
/** CRYP_K0LR_b234 b234 **/
#define CRYP_K0LR_b234		(1 << 10)
/** CRYP_K0LR_b233 b233 **/
#define CRYP_K0LR_b233		(1 << 9)
/** CRYP_K0LR_b232 b232 **/
#define CRYP_K0LR_b232		(1 << 8)
/** CRYP_K0LR_b231 b231 **/
#define CRYP_K0LR_b231		(1 << 7)
/** CRYP_K0LR_b230 b230 **/
#define CRYP_K0LR_b230		(1 << 6)
/** CRYP_K0LR_b229 b229 **/
#define CRYP_K0LR_b229		(1 << 5)
/** CRYP_K0LR_b228 b228 **/
#define CRYP_K0LR_b228		(1 << 4)
/** CRYP_K0LR_b227 b227 **/
#define CRYP_K0LR_b227		(1 << 3)
/** CRYP_K0LR_b226 b226 **/
#define CRYP_K0LR_b226		(1 << 2)
/** CRYP_K0LR_b225 b225 **/
#define CRYP_K0LR_b225		(1 << 1)
/** CRYP_K0LR_b224 b224 **/
#define CRYP_K0LR_b224		(1 << 0)

/**@}*/

/** @defgroup cryp_k0rr K0RR key registers
@{*/

/** CRYP_K0RR_b223 b223 **/
#define CRYP_K0RR_b223		(1 << 31)
/** CRYP_K0RR_b222 b222 **/
#define CRYP_K0RR_b222		(1 << 30)
/** CRYP_K0RR_b221 b221 **/
#define CRYP_K0RR_b221		(1 << 29)
/** CRYP_K0RR_b220 b220 **/
#define CRYP_K0RR_b220		(1 << 28)
/** CRYP_K0RR_b219 b219 **/
#define CRYP_K0RR_b219		(1 << 27)
/** CRYP_K0RR_b218 b218 **/
#define CRYP_K0RR_b218		(1 << 26)
/** CRYP_K0RR_b217 b217 **/
#define CRYP_K0RR_b217		(1 << 25)
/** CRYP_K0RR_b216 b216 **/
#define CRYP_K0RR_b216		(1 << 24)
/** CRYP_K0RR_b215 b215 **/
#define CRYP_K0RR_b215		(1 << 23)
/** CRYP_K0RR_b214 b214 **/
#define CRYP_K0RR_b214		(1 << 22)
/** CRYP_K0RR_b213 b213 **/
#define CRYP_K0RR_b213		(1 << 21)
/** CRYP_K0RR_b212 b212 **/
#define CRYP_K0RR_b212		(1 << 20)
/** CRYP_K0RR_b211 b211 **/
#define CRYP_K0RR_b211		(1 << 19)
/** CRYP_K0RR_b210 b210 **/
#define CRYP_K0RR_b210		(1 << 18)
/** CRYP_K0RR_b209 b209 **/
#define CRYP_K0RR_b209		(1 << 17)
/** CRYP_K0RR_b208 b208 **/
#define CRYP_K0RR_b208		(1 << 16)
/** CRYP_K0RR_b207 b207 **/
#define CRYP_K0RR_b207		(1 << 15)
/** CRYP_K0RR_b206 b206 **/
#define CRYP_K0RR_b206		(1 << 14)
/** CRYP_K0RR_b205 b205 **/
#define CRYP_K0RR_b205		(1 << 13)
/** CRYP_K0RR_b204 b204 **/
#define CRYP_K0RR_b204		(1 << 12)
/** CRYP_K0RR_b203 b203 **/
#define CRYP_K0RR_b203		(1 << 11)
/** CRYP_K0RR_b202 b202 **/
#define CRYP_K0RR_b202		(1 << 10)
/** CRYP_K0RR_b201 b201 **/
#define CRYP_K0RR_b201		(1 << 9)
/** CRYP_K0RR_b200 b200 **/
#define CRYP_K0RR_b200		(1 << 8)
/** CRYP_K0RR_b199 b199 **/
#define CRYP_K0RR_b199		(1 << 7)
/** CRYP_K0RR_b198 b198 **/
#define CRYP_K0RR_b198		(1 << 6)
/** CRYP_K0RR_b197 b197 **/
#define CRYP_K0RR_b197		(1 << 5)
/** CRYP_K0RR_b196 b196 **/
#define CRYP_K0RR_b196		(1 << 4)
/** CRYP_K0RR_b195 b195 **/
#define CRYP_K0RR_b195		(1 << 3)
/** CRYP_K0RR_b194 b194 **/
#define CRYP_K0RR_b194		(1 << 2)
/** CRYP_K0RR_b193 b193 **/
#define CRYP_K0RR_b193		(1 << 1)
/** CRYP_K0RR_b192 b192 **/
#define CRYP_K0RR_b192		(1 << 0)

/**@}*/

/** @defgroup cryp_k1lr K1LR key registers
@{*/

/** CRYP_K1LR_b191 b191 **/
#define CRYP_K1LR_b191		(1 << 31)
/** CRYP_K1LR_b190 b190 **/
#define CRYP_K1LR_b190		(1 << 30)
/** CRYP_K1LR_b189 b189 **/
#define CRYP_K1LR_b189		(1 << 29)
/** CRYP_K1LR_b188 b188 **/
#define CRYP_K1LR_b188		(1 << 28)
/** CRYP_K1LR_b187 b187 **/
#define CRYP_K1LR_b187		(1 << 27)
/** CRYP_K1LR_b186 b186 **/
#define CRYP_K1LR_b186		(1 << 26)
/** CRYP_K1LR_b185 b185 **/
#define CRYP_K1LR_b185		(1 << 25)
/** CRYP_K1LR_b184 b184 **/
#define CRYP_K1LR_b184		(1 << 24)
/** CRYP_K1LR_b183 b183 **/
#define CRYP_K1LR_b183		(1 << 23)
/** CRYP_K1LR_b182 b182 **/
#define CRYP_K1LR_b182		(1 << 22)
/** CRYP_K1LR_b181 b181 **/
#define CRYP_K1LR_b181		(1 << 21)
/** CRYP_K1LR_b180 b180 **/
#define CRYP_K1LR_b180		(1 << 20)
/** CRYP_K1LR_b179 b179 **/
#define CRYP_K1LR_b179		(1 << 19)
/** CRYP_K1LR_b178 b178 **/
#define CRYP_K1LR_b178		(1 << 18)
/** CRYP_K1LR_b177 b177 **/
#define CRYP_K1LR_b177		(1 << 17)
/** CRYP_K1LR_b176 b176 **/
#define CRYP_K1LR_b176		(1 << 16)
/** CRYP_K1LR_b175 b175 **/
#define CRYP_K1LR_b175		(1 << 15)
/** CRYP_K1LR_b174 b174 **/
#define CRYP_K1LR_b174		(1 << 14)
/** CRYP_K1LR_b173 b173 **/
#define CRYP_K1LR_b173		(1 << 13)
/** CRYP_K1LR_b172 b172 **/
#define CRYP_K1LR_b172		(1 << 12)
/** CRYP_K1LR_b171 b171 **/
#define CRYP_K1LR_b171		(1 << 11)
/** CRYP_K1LR_b170 b170 **/
#define CRYP_K1LR_b170		(1 << 10)
/** CRYP_K1LR_b169 b169 **/
#define CRYP_K1LR_b169		(1 << 9)
/** CRYP_K1LR_b168 b168 **/
#define CRYP_K1LR_b168		(1 << 8)
/** CRYP_K1LR_b167 b167 **/
#define CRYP_K1LR_b167		(1 << 7)
/** CRYP_K1LR_b166 b166 **/
#define CRYP_K1LR_b166		(1 << 6)
/** CRYP_K1LR_b165 b165 **/
#define CRYP_K1LR_b165		(1 << 5)
/** CRYP_K1LR_b164 b164 **/
#define CRYP_K1LR_b164		(1 << 4)
/** CRYP_K1LR_b163 b163 **/
#define CRYP_K1LR_b163		(1 << 3)
/** CRYP_K1LR_b162 b162 **/
#define CRYP_K1LR_b162		(1 << 2)
/** CRYP_K1LR_b161 b161 **/
#define CRYP_K1LR_b161		(1 << 1)
/** CRYP_K1LR_b160 b160 **/
#define CRYP_K1LR_b160		(1 << 0)

/**@}*/

/** @defgroup cryp_k1rr K1RR key registers
@{*/

/** CRYP_K1RR_b159 b159 **/
#define CRYP_K1RR_b159		(1 << 31)
/** CRYP_K1RR_b158 b158 **/
#define CRYP_K1RR_b158		(1 << 30)
/** CRYP_K1RR_b157 b157 **/
#define CRYP_K1RR_b157		(1 << 29)
/** CRYP_K1RR_b156 b156 **/
#define CRYP_K1RR_b156		(1 << 28)
/** CRYP_K1RR_b155 b155 **/
#define CRYP_K1RR_b155		(1 << 27)
/** CRYP_K1RR_b154 b154 **/
#define CRYP_K1RR_b154		(1 << 26)
/** CRYP_K1RR_b153 b153 **/
#define CRYP_K1RR_b153		(1 << 25)
/** CRYP_K1RR_b152 b152 **/
#define CRYP_K1RR_b152		(1 << 24)
/** CRYP_K1RR_b151 b151 **/
#define CRYP_K1RR_b151		(1 << 23)
/** CRYP_K1RR_b150 b150 **/
#define CRYP_K1RR_b150		(1 << 22)
/** CRYP_K1RR_b149 b149 **/
#define CRYP_K1RR_b149		(1 << 21)
/** CRYP_K1RR_b148 b148 **/
#define CRYP_K1RR_b148		(1 << 20)
/** CRYP_K1RR_b147 b147 **/
#define CRYP_K1RR_b147		(1 << 19)
/** CRYP_K1RR_b146 b146 **/
#define CRYP_K1RR_b146		(1 << 18)
/** CRYP_K1RR_b145 b145 **/
#define CRYP_K1RR_b145		(1 << 17)
/** CRYP_K1RR_b144 b144 **/
#define CRYP_K1RR_b144		(1 << 16)
/** CRYP_K1RR_b143 b143 **/
#define CRYP_K1RR_b143		(1 << 15)
/** CRYP_K1RR_b142 b142 **/
#define CRYP_K1RR_b142		(1 << 14)
/** CRYP_K1RR_b141 b141 **/
#define CRYP_K1RR_b141		(1 << 13)
/** CRYP_K1RR_b140 b140 **/
#define CRYP_K1RR_b140		(1 << 12)
/** CRYP_K1RR_b139 b139 **/
#define CRYP_K1RR_b139		(1 << 11)
/** CRYP_K1RR_b138 b138 **/
#define CRYP_K1RR_b138		(1 << 10)
/** CRYP_K1RR_b137 b137 **/
#define CRYP_K1RR_b137		(1 << 9)
/** CRYP_K1RR_b136 b136 **/
#define CRYP_K1RR_b136		(1 << 8)
/** CRYP_K1RR_b135 b135 **/
#define CRYP_K1RR_b135		(1 << 7)
/** CRYP_K1RR_b134 b134 **/
#define CRYP_K1RR_b134		(1 << 6)
/** CRYP_K1RR_b133 b133 **/
#define CRYP_K1RR_b133		(1 << 5)
/** CRYP_K1RR_b132 b132 **/
#define CRYP_K1RR_b132		(1 << 4)
/** CRYP_K1RR_b131 b131 **/
#define CRYP_K1RR_b131		(1 << 3)
/** CRYP_K1RR_b130 b130 **/
#define CRYP_K1RR_b130		(1 << 2)
/** CRYP_K1RR_b129 b129 **/
#define CRYP_K1RR_b129		(1 << 1)
/** CRYP_K1RR_b128 b128 **/
#define CRYP_K1RR_b128		(1 << 0)

/**@}*/

/** @defgroup cryp_k2lr K2LR key registers
@{*/

/** CRYP_K2LR_b127 b127 **/
#define CRYP_K2LR_b127		(1 << 31)
/** CRYP_K2LR_b126 b126 **/
#define CRYP_K2LR_b126		(1 << 30)
/** CRYP_K2LR_b125 b125 **/
#define CRYP_K2LR_b125		(1 << 29)
/** CRYP_K2LR_b124 b124 **/
#define CRYP_K2LR_b124		(1 << 28)
/** CRYP_K2LR_b123 b123 **/
#define CRYP_K2LR_b123		(1 << 27)
/** CRYP_K2LR_b122 b122 **/
#define CRYP_K2LR_b122		(1 << 26)
/** CRYP_K2LR_b121 b121 **/
#define CRYP_K2LR_b121		(1 << 25)
/** CRYP_K2LR_b120 b120 **/
#define CRYP_K2LR_b120		(1 << 24)
/** CRYP_K2LR_b119 b119 **/
#define CRYP_K2LR_b119		(1 << 23)
/** CRYP_K2LR_b118 b118 **/
#define CRYP_K2LR_b118		(1 << 22)
/** CRYP_K2LR_b117 b117 **/
#define CRYP_K2LR_b117		(1 << 21)
/** CRYP_K2LR_b116 b116 **/
#define CRYP_K2LR_b116		(1 << 20)
/** CRYP_K2LR_b115 b115 **/
#define CRYP_K2LR_b115		(1 << 19)
/** CRYP_K2LR_b114 b114 **/
#define CRYP_K2LR_b114		(1 << 18)
/** CRYP_K2LR_b113 b113 **/
#define CRYP_K2LR_b113		(1 << 17)
/** CRYP_K2LR_b112 b112 **/
#define CRYP_K2LR_b112		(1 << 16)
/** CRYP_K2LR_b111 b111 **/
#define CRYP_K2LR_b111		(1 << 15)
/** CRYP_K2LR_b110 b110 **/
#define CRYP_K2LR_b110		(1 << 14)
/** CRYP_K2LR_b109 b109 **/
#define CRYP_K2LR_b109		(1 << 13)
/** CRYP_K2LR_b108 b108 **/
#define CRYP_K2LR_b108		(1 << 12)
/** CRYP_K2LR_b107 b107 **/
#define CRYP_K2LR_b107		(1 << 11)
/** CRYP_K2LR_b106 b106 **/
#define CRYP_K2LR_b106		(1 << 10)
/** CRYP_K2LR_b105 b105 **/
#define CRYP_K2LR_b105		(1 << 9)
/** CRYP_K2LR_b104 b104 **/
#define CRYP_K2LR_b104		(1 << 8)
/** CRYP_K2LR_b103 b103 **/
#define CRYP_K2LR_b103		(1 << 7)
/** CRYP_K2LR_b102 b102 **/
#define CRYP_K2LR_b102		(1 << 6)
/** CRYP_K2LR_b101 b101 **/
#define CRYP_K2LR_b101		(1 << 5)
/** CRYP_K2LR_b100 b100 **/
#define CRYP_K2LR_b100		(1 << 4)
/** CRYP_K2LR_b99 b99 **/
#define CRYP_K2LR_b99		(1 << 3)
/** CRYP_K2LR_b98 b98 **/
#define CRYP_K2LR_b98		(1 << 2)
/** CRYP_K2LR_b97 b97 **/
#define CRYP_K2LR_b97		(1 << 1)
/** CRYP_K2LR_b96 b96 **/
#define CRYP_K2LR_b96		(1 << 0)

/**@}*/

/** @defgroup cryp_k2rr K2RR key registers
@{*/

/** CRYP_K2RR_b95 b95 **/
#define CRYP_K2RR_b95		(1 << 31)
/** CRYP_K2RR_b94 b94 **/
#define CRYP_K2RR_b94		(1 << 30)
/** CRYP_K2RR_b93 b93 **/
#define CRYP_K2RR_b93		(1 << 29)
/** CRYP_K2RR_b92 b92 **/
#define CRYP_K2RR_b92		(1 << 28)
/** CRYP_K2RR_b91 b91 **/
#define CRYP_K2RR_b91		(1 << 27)
/** CRYP_K2RR_b90 b90 **/
#define CRYP_K2RR_b90		(1 << 26)
/** CRYP_K2RR_b89 b89 **/
#define CRYP_K2RR_b89		(1 << 25)
/** CRYP_K2RR_b88 b88 **/
#define CRYP_K2RR_b88		(1 << 24)
/** CRYP_K2RR_b87 b87 **/
#define CRYP_K2RR_b87		(1 << 23)
/** CRYP_K2RR_b86 b86 **/
#define CRYP_K2RR_b86		(1 << 22)
/** CRYP_K2RR_b85 b85 **/
#define CRYP_K2RR_b85		(1 << 21)
/** CRYP_K2RR_b84 b84 **/
#define CRYP_K2RR_b84		(1 << 20)
/** CRYP_K2RR_b83 b83 **/
#define CRYP_K2RR_b83		(1 << 19)
/** CRYP_K2RR_b82 b82 **/
#define CRYP_K2RR_b82		(1 << 18)
/** CRYP_K2RR_b81 b81 **/
#define CRYP_K2RR_b81		(1 << 17)
/** CRYP_K2RR_b80 b80 **/
#define CRYP_K2RR_b80		(1 << 16)
/** CRYP_K2RR_b79 b79 **/
#define CRYP_K2RR_b79		(1 << 15)
/** CRYP_K2RR_b78 b78 **/
#define CRYP_K2RR_b78		(1 << 14)
/** CRYP_K2RR_b77 b77 **/
#define CRYP_K2RR_b77		(1 << 13)
/** CRYP_K2RR_b76 b76 **/
#define CRYP_K2RR_b76		(1 << 12)
/** CRYP_K2RR_b75 b75 **/
#define CRYP_K2RR_b75		(1 << 11)
/** CRYP_K2RR_b74 b74 **/
#define CRYP_K2RR_b74		(1 << 10)
/** CRYP_K2RR_b73 b73 **/
#define CRYP_K2RR_b73		(1 << 9)
/** CRYP_K2RR_b72 b72 **/
#define CRYP_K2RR_b72		(1 << 8)
/** CRYP_K2RR_b71 b71 **/
#define CRYP_K2RR_b71		(1 << 7)
/** CRYP_K2RR_b70 b70 **/
#define CRYP_K2RR_b70		(1 << 6)
/** CRYP_K2RR_b69 b69 **/
#define CRYP_K2RR_b69		(1 << 5)
/** CRYP_K2RR_b68 b68 **/
#define CRYP_K2RR_b68		(1 << 4)
/** CRYP_K2RR_b67 b67 **/
#define CRYP_K2RR_b67		(1 << 3)
/** CRYP_K2RR_b66 b66 **/
#define CRYP_K2RR_b66		(1 << 2)
/** CRYP_K2RR_b65 b65 **/
#define CRYP_K2RR_b65		(1 << 1)
/** CRYP_K2RR_b64 b64 **/
#define CRYP_K2RR_b64		(1 << 0)

/**@}*/

