grevaillot/svd_tools/headers/STM32F21x/cryp.h
/** @defgroup cryp_k3lr K3LR key registers
@{*/

/** CRYP_K3LR_b63 b63 **/
#define CRYP_K3LR_b63		(1 << 31)
/** CRYP_K3LR_b62 b62 **/
#define CRYP_K3LR_b62		(1 << 30)
/** CRYP_K3LR_b61 b61 **/
#define CRYP_K3LR_b61		(1 << 29)
/** CRYP_K3LR_b60 b60 **/
#define CRYP_K3LR_b60		(1 << 28)
/** CRYP_K3LR_b59 b59 **/
#define CRYP_K3LR_b59		(1 << 27)
/** CRYP_K3LR_b58 b58 **/
#define CRYP_K3LR_b58		(1 << 26)
/** CRYP_K3LR_b57 b57 **/
#define CRYP_K3LR_b57		(1 << 25)
/** CRYP_K3LR_b56 b56 **/
#define CRYP_K3LR_b56		(1 << 24)
/** CRYP_K3LR_b55 b55 **/
#define CRYP_K3LR_b55		(1 << 23)
/** CRYP_K3LR_b54 b54 **/
#define CRYP_K3LR_b54		(1 << 22)
/** CRYP_K3LR_b53 b53 **/
#define CRYP_K3LR_b53		(1 << 21)
/** CRYP_K3LR_b52 b52 **/
#define CRYP_K3LR_b52		(1 << 20)
/** CRYP_K3LR_b51 b51 **/
#define CRYP_K3LR_b51		(1 << 19)
/** CRYP_K3LR_b50 b50 **/
#define CRYP_K3LR_b50		(1 << 18)
/** CRYP_K3LR_b49 b49 **/
#define CRYP_K3LR_b49		(1 << 17)
/** CRYP_K3LR_b48 b48 **/
#define CRYP_K3LR_b48		(1 << 16)
/** CRYP_K3LR_b47 b47 **/
#define CRYP_K3LR_b47		(1 << 15)
/** CRYP_K3LR_b46 b46 **/
#define CRYP_K3LR_b46		(1 << 14)
/** CRYP_K3LR_b45 b45 **/
#define CRYP_K3LR_b45		(1 << 13)
/** CRYP_K3LR_b44 b44 **/
#define CRYP_K3LR_b44		(1 << 12)
/** CRYP_K3LR_b43 b43 **/
#define CRYP_K3LR_b43		(1 << 11)
/** CRYP_K3LR_b42 b42 **/
#define CRYP_K3LR_b42		(1 << 10)
/** CRYP_K3LR_b41 b41 **/
#define CRYP_K3LR_b41		(1 << 9)
/** CRYP_K3LR_b40 b40 **/
#define CRYP_K3LR_b40		(1 << 8)
/** CRYP_K3LR_b39 b39 **/
#define CRYP_K3LR_b39		(1 << 7)
/** CRYP_K3LR_b38 b38 **/
#define CRYP_K3LR_b38		(1 << 6)
/** CRYP_K3LR_b37 b37 **/
#define CRYP_K3LR_b37		(1 << 5)
/** CRYP_K3LR_b36 b36 **/
#define CRYP_K3LR_b36		(1 << 4)
/** CRYP_K3LR_b35 b35 **/
#define CRYP_K3LR_b35		(1 << 3)
/** CRYP_K3LR_b34 b34 **/
#define CRYP_K3LR_b34		(1 << 2)
/** CRYP_K3LR_b33 b33 **/
#define CRYP_K3LR_b33		(1 << 1)
/** CRYP_K3LR_b32 b32 **/
#define CRYP_K3LR_b32		(1 << 0)

/**@}*/

/** @defgroup cryp_k3rr K3RR key registers
@{*/

/** CRYP_K3RR_b31 b31 **/
#define CRYP_K3RR_b31		(1 << 31)
/** CRYP_K3RR_b30 b30 **/
#define CRYP_K3RR_b30		(1 << 30)
/** CRYP_K3RR_b29 b29 **/
#define CRYP_K3RR_b29		(1 << 29)
/** CRYP_K3RR_b28 b28 **/
#define CRYP_K3RR_b28		(1 << 28)
/** CRYP_K3RR_b27 b27 **/
#define CRYP_K3RR_b27		(1 << 27)
/** CRYP_K3RR_b26 b26 **/
#define CRYP_K3RR_b26		(1 << 26)
/** CRYP_K3RR_b25 b25 **/
#define CRYP_K3RR_b25		(1 << 25)
/** CRYP_K3RR_b24 b24 **/
#define CRYP_K3RR_b24		(1 << 24)
/** CRYP_K3RR_b23 b23 **/
#define CRYP_K3RR_b23		(1 << 23)
/** CRYP_K3RR_b22 b22 **/
#define CRYP_K3RR_b22		(1 << 22)
/** CRYP_K3RR_b21 b21 **/
#define CRYP_K3RR_b21		(1 << 21)
/** CRYP_K3RR_b20 b20 **/
#define CRYP_K3RR_b20		(1 << 20)
/** CRYP_K3RR_b19 b19 **/
#define CRYP_K3RR_b19		(1 << 19)
/** CRYP_K3RR_b18 b18 **/
#define CRYP_K3RR_b18		(1 << 18)
/** CRYP_K3RR_b17 b17 **/
#define CRYP_K3RR_b17		(1 << 17)
/** CRYP_K3RR_b16 b16 **/
#define CRYP_K3RR_b16		(1 << 16)
/** CRYP_K3RR_b15 b15 **/
#define CRYP_K3RR_b15		(1 << 15)
/** CRYP_K3RR_b14 b14 **/
#define CRYP_K3RR_b14		(1 << 14)
/** CRYP_K3RR_b13 b13 **/
#define CRYP_K3RR_b13		(1 << 13)
/** CRYP_K3RR_b12 b12 **/
#define CRYP_K3RR_b12		(1 << 12)
/** CRYP_K3RR_b11 b11 **/
#define CRYP_K3RR_b11		(1 << 11)
/** CRYP_K3RR_b10 b10 **/
#define CRYP_K3RR_b10		(1 << 10)
/** CRYP_K3RR_b9 b9 **/
#define CRYP_K3RR_b9		(1 << 9)
/** CRYP_K3RR_b8 b8 **/
#define CRYP_K3RR_b8		(1 << 8)
/** CRYP_K3RR_b7 b7 **/
#define CRYP_K3RR_b7		(1 << 7)
/** CRYP_K3RR_b6 b6 **/
#define CRYP_K3RR_b6		(1 << 6)
/** CRYP_K3RR_b5 b5 **/
#define CRYP_K3RR_b5		(1 << 5)
/** CRYP_K3RR_b4 b4 **/
#define CRYP_K3RR_b4		(1 << 4)
/** CRYP_K3RR_b3 b3 **/
#define CRYP_K3RR_b3		(1 << 3)
/** CRYP_K3RR_b2 b2 **/
#define CRYP_K3RR_b2		(1 << 2)
/** CRYP_K3RR_b1 b1 **/
#define CRYP_K3RR_b1		(1 << 1)
/** CRYP_K3RR_b0 b0 **/
#define CRYP_K3RR_b0		(1 << 0)

/**@}*/

/** @defgroup cryp_iv0lr IV0LR initialization vector registers
@{*/

/** CRYP_IV0LR_IV0 IV0 **/
#define CRYP_IV0LR_IV0		(1 << 31)
/** CRYP_IV0LR_IV1 IV1 **/
#define CRYP_IV0LR_IV1		(1 << 30)
/** CRYP_IV0LR_IV2 IV2 **/
#define CRYP_IV0LR_IV2		(1 << 29)
/** CRYP_IV0LR_IV3 IV3 **/
#define CRYP_IV0LR_IV3		(1 << 28)
/** CRYP_IV0LR_IV4 IV4 **/
#define CRYP_IV0LR_IV4		(1 << 27)
/** CRYP_IV0LR_IV5 IV5 **/
#define CRYP_IV0LR_IV5		(1 << 26)
/** CRYP_IV0LR_IV6 IV6 **/
#define CRYP_IV0LR_IV6		(1 << 25)
/** CRYP_IV0LR_IV7 IV7 **/
#define CRYP_IV0LR_IV7		(1 << 24)
/** CRYP_IV0LR_IV8 IV8 **/
#define CRYP_IV0LR_IV8		(1 << 23)
/** CRYP_IV0LR_IV9 IV9 **/
#define CRYP_IV0LR_IV9		(1 << 22)
/** CRYP_IV0LR_IV10 IV10 **/
#define CRYP_IV0LR_IV10		(1 << 21)
/** CRYP_IV0LR_IV11 IV11 **/
#define CRYP_IV0LR_IV11		(1 << 20)
/** CRYP_IV0LR_IV12 IV12 **/
#define CRYP_IV0LR_IV12		(1 << 19)
/** CRYP_IV0LR_IV13 IV13 **/
#define CRYP_IV0LR_IV13		(1 << 18)
/** CRYP_IV0LR_IV14 IV14 **/
#define CRYP_IV0LR_IV14		(1 << 17)
/** CRYP_IV0LR_IV15 IV15 **/
#define CRYP_IV0LR_IV15		(1 << 16)
/** CRYP_IV0LR_IV16 IV16 **/
#define CRYP_IV0LR_IV16		(1 << 15)
/** CRYP_IV0LR_IV17 IV17 **/
#define CRYP_IV0LR_IV17		(1 << 14)
/** CRYP_IV0LR_IV18 IV18 **/
#define CRYP_IV0LR_IV18		(1 << 13)
/** CRYP_IV0LR_IV19 IV19 **/
#define CRYP_IV0LR_IV19		(1 << 12)
/** CRYP_IV0LR_IV20 IV20 **/
#define CRYP_IV0LR_IV20		(1 << 11)
/** CRYP_IV0LR_IV21 IV21 **/
#define CRYP_IV0LR_IV21		(1 << 10)
/** CRYP_IV0LR_IV22 IV22 **/
#define CRYP_IV0LR_IV22		(1 << 9)
/** CRYP_IV0LR_IV23 IV23 **/
#define CRYP_IV0LR_IV23		(1 << 8)
/** CRYP_IV0LR_IV24 IV24 **/
#define CRYP_IV0LR_IV24		(1 << 7)
/** CRYP_IV0LR_IV25 IV25 **/
#define CRYP_IV0LR_IV25		(1 << 6)
/** CRYP_IV0LR_IV26 IV26 **/
#define CRYP_IV0LR_IV26		(1 << 5)
/** CRYP_IV0LR_IV27 IV27 **/
#define CRYP_IV0LR_IV27		(1 << 4)
/** CRYP_IV0LR_IV28 IV28 **/
#define CRYP_IV0LR_IV28		(1 << 3)
/** CRYP_IV0LR_IV29 IV29 **/
#define CRYP_IV0LR_IV29		(1 << 2)
/** CRYP_IV0LR_IV30 IV30 **/
#define CRYP_IV0LR_IV30		(1 << 1)
/** CRYP_IV0LR_IV31 IV31 **/
#define CRYP_IV0LR_IV31		(1 << 0)

/**@}*/

/** @defgroup cryp_iv0rr IV0RR initialization vector registers
@{*/

